//Вывести на одной строке числа 1, 13 и 49 с одним пробелом между ними.

int numberA = 1;
int numberB = 13;
int numberC = 49;
System.Console.WriteLine($"{numberA} {numberB} {numberC}");
