//Вывести на экран число e (основание натурального логарифма) с точностью до десятых.


double e = Math.Round(Math.E, 1);       
System.Console.WriteLine(e);

