
//Дана сторона квадрата. Найти его периметр. — решение.

Console.WriteLine("Введите длину стороны квадрата: ");
int number = Convert.ToInt32(Console.ReadLine());
System.Console.WriteLine($"Периметр квардата равен {number * 4}");