//Составить программу вывода на экран следующей информации:
//5 10
//7 см

int numberA = 5;
int numberB = 10;
string str = ("7 см");
Console.WriteLine($"{numberA} {numberB}");
Console.WriteLine($"{str}");