//Вывести на экран числа 5, 10 и 21 одно под другим.

int numberA = 5;
int numberB = 10;
int numberС = 21;
System.Console.WriteLine($"{numberA}");
System.Console.WriteLine($"{numberB}");
System.Console.WriteLine($"{numberС}");