// Дан радиус окружности. Найти ее диаметр. — решение.

Console.WriteLine("Введите радиус окружности: ");
int radius = Convert.ToInt32(Console.ReadLine());
System.Console.WriteLine($"Диаметр окружности {radius * 2}");
