//Вывести на одной строке числа 7, 15 и 100 с двумя пробелами между ними.

int numberA = 7;
int numberB = 15;
int numberC = 100;
System.Console.WriteLine($"{numberA}  {numberB}  {numberC}");