//Составить программу вывода на экран следующей информации:
//2 кг
//13 17

string str = "2 кг";
int numberA = 13;
int numberB = 17;
Console.WriteLine($"{str}");
Console.WriteLine($"{numberA} {numberB}");