//Вывести на экран числа 50 и 10 одно под другим.

int numberA = 50;
int numberB = 10;
System.Console.WriteLine($"{numberA}");
System.Console.WriteLine($"{numberB}");